app/controllers/articles_controller.rb

  def index
    @difficulty_levels = Article.distinct.pluck(:difficulty_level)
    @articles_by_difficulty = Article.all.group_by(&:difficulty_level)
---
SELECT DISTINCT "articles"."difficulty_level" FROM "articles"
SELECT "articles".* FROM "articles"

  def explanation
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]