app/controllers/practices_controller.rb

SELECT DISTINCT "articles"."difficulty_level" FROM "articles"
---
  def new
    @practice = Practice.new
    @difficulty_levels = Article.distinct.pluck(:difficulty_level)

INSERT INTO "practices" ("user_id", "start_time", "end_time", "score", "difficulty_level", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 3], ["start_time", nil], ["end_time", nil], ["score", nil], ["difficulty_level", "Easy"], ["created_at", "2024-05-26 01:43:37.148518"], ["updated_at", "2024-05-26 01:43:37.148518"]]
---
  def create
    practice = Practice.new(practice_params.merge(user: current_user, start_time: Time.now))
    if practice.save

SELECT "practices".* FROM "practices" WHERE "practices"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."difficulty_level" = $1 ORDER BY RANDOM() LIMIT $2  [["difficulty_level", "easy"], ["LIMIT", 1]]
---
  def show
    @practice = Practice.find(params[:id])
    @article = Article.where(difficulty_level: @practice.difficulty_level).order("RANDOM()").first

SELECT "articles".* FROM "articles" WHERE "articles"."difficulty_level" = $1 ORDER BY RANDOM() LIMIT $2  [["difficulty_level", "easy"], ["LIMIT", 1]]
---
  def new_word
    @article = Article.where(difficulty_level: params[:difficulty_level]).order("RANDOM()").first

SELECT "practices".* FROM "practices" WHERE "practices"."id" = $1 LIMIT $2  [["id", 65], ["LIMIT", 1]]
---
  def result
    @practice = Practice.find(params[:id])

SELECT "practices".* FROM "practices" WHERE "practices"."id" = $1 LIMIT $2  [["id", 65], ["LIMIT", 1]]
UPDATE "practices" SET "end_time" = $1, "score" = $2, "updated_at" = $3 WHERE "practices"."id" = $4  [["end_time", "2024-05-27 02:21:59.201000"], ["score", 2], ["updated_at", "2024-05-27 02:21:59.214644"], ["id", 65]]
---
  def update
    @practice = Practice.find(params[:id])
    if @practice.update(practice_params)