app/controllers/users_controller.rb

INSERT INTO "users" ("email", "crypted_password", "salt", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save